;Доступные переменные:
;
;Основные:
;
;ПрефиксИБ -- Применимо к базе с префиксом
;Описание -- Описание загрузки
;ПапкаЗагрузки -- Загружать из папки (? -- выбрать папку до начала загрузки)
;Шаблон -- Наименование файла-шаблона загрузки
;
;Доп. свойства:
;
;ОчиститьПапкуПослеЗагрузки -- Удалить все файлы из папки после успшного окончания загрузки
;

;Формат файла-шаблона:
;[<Файл1>]
;... (загрузка из первого источника)
;[<Файл2>]
;... (загрузка из второго источника)
;...
;
;Переменные:
;ИмяФайла="<ИмяФайлаВыгрузки>" -- имя файла загрузки (возможно использование символов *,? и пр.)
;Описание="<Описание>" -- название данного подпункта загрузки
;СпособОбновленияДокументов="<Способ>" -- 0 -- загружать только новые, 1 -- загружать и обновлять (кроме обработанных), 2 -- загружать и обновлять (включая обработанные), 3 -- не контролировать (загружать всегда новые)
;                                         4 -- только обновлять (загрузка реквизитов), список обновляемых реквизитов должен храниться в aVars в переменной "СписокОбновляемыхРеквизитов"
;ТипДокументов="<Тип>" -- Тип загружаемых документов (пример: Реализация)
;КодОперации="<Код>" -- Код операции загружаемых документов (пример: Реализация)
;КонвертироватьИзUTF8="<Флаг>" -- конвертировать из UTF8 до загрузки
;КорректироватьСтруктуруXML="<Флаг>" -- Очищает XML-файл до загрузки, чтобы каждый тэг начинался с новой строки и заканчивался в этой же строке
;СтолбцыТаблицыЗагрузки="<ЗаголСтолбец1>:<Ширина1>[:<ИмяПеременной1>],..." -- Задает столбцы таблицы при загрузке и их соответсвие внутренним переменным
;ШаблонПересчетаСтроки="<Шаблон>" -- пересчитывает строку создаваемого документа по данному шаблону (пример: "Код@Количество2@Цена@Сумма@СуммаНДС")
;
;Не реализовано (пока):
;ПолучитьСFTP="<user>:<password>@<ftpURL> [<FtpFolder\>] [<SOCKsProxyServer>:<ProxyPort>]" -- будут загружены все файлы (соответствующие маске ИмяФайла) из указаного каталога FTP
;
;Переменные:
;Переменные заголовка документа в списке aVars, чтобы прочитать переменную, используется выражение aVars.GetByName("<ИмяПеременной>"),
;           чтобы изменить переменную, используется выражение aVars.SetByNames("<ИмяПеременной>",<ЗначениеПеременной>)
;Переменные текущей строки документа хранятся в списке aLine
;Переменные всех строк документа хранятся в таблице aLines со столбцов aVars
;
;Исполнение выражений:
;
;В любой части файла шаблона можно использовать исполняемые выражения. Выражение заключено в знаки !!!. Пример: !!!Replace(CreateGUID(),"-","")!!!
;
;
;Разделы шаблона загрузки:
;Любой раздел оформляется в следующем виде:
;
;Начало<Раздел>="<Позиция>"
;...
;@TEMPLATE@
;...<Текст и переменные, переменные включаются в знаки %%<имя>%%, могут содержать знаки |, см. описание <Позиция>>
;@TEMPLATE@
;...<Кусок кода для исполнения>
;@TEMPLATE@
;...<Текст и переменные, переменные включаются в знаки %%<имя>%%, могут содержать знаки |, см. описание <Позиция>>
;@TEMPLATE@
;...
;Конец<Раздел>="<Позиция>"
;
;Возможные разделы:
;
;НачалоЗаголовкаФайла="<Позиция>"
;КонецЗаголовкаФайла="<Позиция>"
;
;НачалоЗаголовка="<Позиция>"
;КонецЗаголовка="<Позиция>"
;
;НачалоСтроки="<Позиция>"
;КонецСтроки="<Позиция>"
;
;НачалоЗавершения="<Позиция>"
;КонецЗавершения="<Позиция>"
;
;НачалоЗавершенияФайла="<Позиция>"
;КонецЗавершенияФайла="<Позиция>"
;
;<Позиция>: Куски текста оригинального файла, по которым можно перейти к нужной позиции в файле
;           Куски разделяются знаком | и могут содержать исполняемые выражения
;Пример:
;
;НачалоЗаголовка="<DOCUMENTNAME>220</DOCUMENTNAME>"
;@TEMPLATE@
;<NUMBER>%%ИхНомер%%</NUMBER>
;<DATE>%%ДатаДок%%</DATE>
;<DELIVERYDATE>%%ДатаДоставки%%</DELIVERYDATE>
;<SUPPLIER>%%КодАналитики%%</SUPPLIER>
;<DELIVERYPLACE>%%КодТочки%%</DELIVERYPLACE>
;@TEMPLATE@
;aVars.SetByName("Склад",DB("Ref.ОбщСклады","Code","000000000007"));
;aEl:=Ref.общУправленческиеАналитики;
;If Not aEl.Find("УникальныйИдентификатор",aVars.GetByName("КодАналитики")) Then
;  Raise "Невозможно найти аналитику с уник. идентификатором "+aVars.GetByName("КодАналитики");
;EndIf;
;aVars.SetByName("УникальныйИдентификатор","EDIA"+aVars.GetByName("ИхНомер"));
;aVars.SetByName("НомерДокВходящий",aVars.GetByName("ИхНомер"));
;bEl:=Ref.адСсылкиНаАдресаДоставки;
;bEl.Select("КодКомитента,@Status",aVars.GetByName("КодТочки"),0);
;Фл:=0;
;While bEl.Next() Do
;  If bEl.Parent().УпрАналитика=aEl Then
;    Фл:=1;
;    Break;
;  EndIf;
;EndDo;
;If Not Фл Then
;  Raise "Не найден адрес доставки с кодом aVars.GetByName("КодТочки")! Пожалуйста, заполните сопоставление, прежде чем загружать документ!";
;EndIf;
;aVars.SetByName("АдресДоставки",bEl);
;КонецЗаголовка="<EDIINTERCHANGEID>"
;
;
;

;Пример
;[Загрузка ?]
;ПрефиксИБ="?,?"
;Описание="Загрузка ?"
;Шаблон="?.ini"
;ДополнительныйСписок="Обычная загрузка,Загрузка 2,Загрузка 3"
;ОчиститьПапкуПослеЗагрузки="1"
